Repository: ARahmanAR/BatFi
Catalog: BatFiKit/Sources/L10n/*.lproj/Localizable.strings
Languages: ja, pl

# about.button.label.license
source: License
ja: ライセンス
pl: Licencja

# about.button.label.website
source: Website
ja: Webサイト
pl: Strona www

# app_charging_mode.state.description.charging
source: The limit is %@.
ja: 制限は%@です。
pl: Limit to %@.

# app_charging_mode.state.description.force_charge
source: Charging to 100%%
ja: 100%まで充電する
pl: Ładuję do 100%%

# app_charging_mode.state.description.force_discharge
source: Using the battery.
ja: バッテリーを使う。
pl: Używam baterii do zasilania.

# app_charging_mode.state.description.inhibit
source: The charging limit is set to %@.
ja: 充電制限は%@に設定されています。
pl: Limit ładowania to %@.

# app_charging_mode.state.title.charger_not_connected
source: Charger not connected
ja: 充電器が未接続です
pl: Ładowarka nie podłączona

# app_charging_mode.state.title.charging
source: Charging to the limit
ja: 限界まで充電する
pl: Ładuję do limitu

# app_charging_mode.state.title.force_charge
source: Charging
ja: 充電中
pl: Ładuję

# app_charging_mode.state.title.force_discharge
source: Discharging
ja: 放電中
pl: Rozładowuję

# app_charging_mode.state.title.inhibit
source: Inhibiting charging
ja: 充電の抑制
pl: Ładowanie wstrzymane

# app_charging_mode.state.title.initial
source: Initializing
ja: 初期化
pl: Inicjalizacja

# battery_info.label.additional.app_mode
source: App mode
ja: 充電モード
pl: Tryb apki

# battery_info.label.additional.battery_capacity
source: Battery Health
ja: バッテリー状態
pl: Żywotność baterii

# battery_info.label.additional.cycle_count
source: Cycle Count
ja: 充電回数
pl: Liczba cykli

# battery_info.label.additional.power_source
source: Power Source
ja: 電源
pl: Źródło zasilania

# battery_info.label.additional.temperature
source: Temperature
ja: 温度
pl: Temperatura baterii

# battery_info.label.info_missing
source: Info is missing
ja: 情報が見つかりません
pl: Czekam na informacje

# battery_info.label.main.battery
source: Battery
ja: バッテリー
pl: Bateria

# battery_info.label.main.time.calculating
source: Calculating…
ja: 計算中
pl: Obliczam…

# battery_info.label.main.time.time_left
source: Time Left
ja: 残り時間
pl: Pozostało

# battery_info.label.main.time.time_to_charge
source: Time to Charge
ja: 充電時間
pl: Czas do naładowania

# menu.label.charge_to_hundred
source: Charge to 100%%
ja: 100%まで充電
pl: Naładuj do 100%%

# menu.label.check_for_updates
source: Check for Updates…
ja: アップデートを確認
pl: Sprawdź uaktualnienia…

# menu.label.debug
source: Debug
ja: デバッグ

# menu.label.install_helper
source: Install Helper
ja: ヘルパーをインストール
pl: Zainstaluj helper

# menu.label.more
source: More
ja: 詳細
pl: Więcej

# menu.label.onboarding
source: Onboarding…
ja: オンボーディング

# menu.label.quit
source: Quit BatFi
ja: BatFiを終了する
pl: Zakończ BatFi

# menu.label.remove_helper
source: Remove Helper
ja: ヘルパーをアンインストール
pl: Odinstaluj helper

# menu.label.reset_settings
source: Reset settings
ja: 設定をリセット
pl: Przywróć domyślne ustawienia

# menu.label.settings
source: Settings…
ja: アプリの設定を開く
pl: Ustawienia…

# menu.label.stop_charging_to_hundred
source: Stop charging to 100%%
ja: 100%%に充電を停止する
pl: Zatrzymaj ładowanie do 100%%

# menu.tooltip.charge_to_hundred.charger_not_connected
source: Disabled because the charger is not connected
ja: 充電器が接続されていないため無効になっています
pl: Niedostępne ponieważ ładowarka nie jest podłączona

# menu.tooltip.charge_to_hundred.discharge_turned_on
source: Disabled because the "Discharge battery when charged over limit" is turned on
ja: 「制限を超えて充電されたときにバッテリーを放電する」がオンになっているため、無効になります
pl: Niedostępne ponieważ "Rozładuj baterię gdy naładowana ponad limit" jest włączone

# notifications.alert.title.optimized_charging_turned_on
source: Optimized battery charging is turned ON
ja: 最適化されたバッテリー充電がオンになっています
pl: Zoptymalizowane ładowanie baterii jest WŁĄCZONE

# notifications.notification.subtitle.new_mode
source: New mode: %@
ja: 新しいモード: %@
pl: Nowy tryb: %@

# onboarding.alert.button.label.open_system_settings
source: Open System Settings
ja: システム設定を開く
pl: Otwórz Ustawienia systemu

# onboarding.alert.message.helper_not_installed
source: It seems that you didn't give permissions to the helper. If there was no password/Touch ID prompt that's okay – it's a macOS bug and sometimes it happens. You can always change permissions in the System Settings. Please keep in mind that the app won't work without the helper tool.
ja: ヘルパーにパーミッションを与えていないようです。パスワード/Touch IDのプロンプトが表示されなかったのなら、それは問題ありません。macOSのバグで、時々起こります。 システム設定でいつでも権限を変更できます。ヘルパーツールがないとアプリは動作しないことを覚えておいてください。
pl: Wygląda na to, że wciąż nie dałeś uprawnień helperowi. Jeśli nie widziałeś okna od hasła lub Touch ID to ok – czasem macOS go nie pokazuje i jest to bug systemu. Zawsze możesz zmienić uprawnienie w Ustawieniach systemu. Pamiętaj, że apka nie będzie działać bez tego helpera.

# onboarding.alert.title.helper_not_installed
source: Helper (still) not installed
ja: ヘルパーがインストールされていません。
pl: Helper (wciąż) nie jest zainstalowany

# onboarding.button.label.complete
source: Complete
ja: コンプリート
pl: Gotowe

# onboarding.button.label.get_started
source: Get started
ja: 始める
pl: Zaczynamy

# onboarding.button.label.install_helper
source: Install helper
ja: ヘルパーをインストール
pl: Zainstaluj helper

# onboarding.button.label.launch_at_login
source: Launch BatFi at login
ja: ログイン時にBatFiを開く
pl: Uruchom podczas logowania

# onboarding.button.label.next
source: Next
ja: 次へ
pl: Dalej

# onboarding.button.label.previous
source: Previous
ja: 前へ
pl: Wstecz

# onboarding.label.almost_done
source: Almost done.
ja: もう少し
pl: Prawie gotowe.

# onboarding.label.app_description
source: BatFi helps you optimize your macOS battery performance by managing charging levels intelligently, yet giving you full control – charging to 100%% only when it's needed.
ja: BatFiは、必要な時のみ100%%まで充電することでmacOSのバッテリーパフォーマンスを最適化することができます。
pl: BatFi pozwala zwiększyć wydajność baterii poprzez utrzymywanie optymalnych poziomów naładowania pozostawiając Ci pełną kontrolę – wciąż możesz ładować baterię do 100%% gdy potrzeba.

# onboarding.label.app_is_ready
source: The app is ready to use!
ja: アプリはすぐに使えます！
pl: Apka jest gotowa do działania!

# onboarding.label.done
source: Done.
ja: 完了
pl: Gotowe.

# onboarding.label.extend_life
source: Extend the life of your Mac.
ja: Macのバッテリー寿命を延ばしましょう。
pl: Przedłuż życie swojego Maca.

# onboarding.label.helper_description
source: BatFi will install helper tool, that will work in background and is able to change your computer's charging mode.
ja: BatFiは、バックグラウンドで動作し、コンピュータの充電モードを変更することができるヘルパーツールをインストールします。
pl: BatFi zainstaluje helper, który będzie działał w tle i ma możliwość zmiany trybu ładowania Twojego komputera.

# onboarding.label.helper_requires_admin
source: Installing the helper tool requires admin permissions and is essential for BatFi's functionality.
ja: ヘルパーはBatFiを適切に機能させるために不可欠です。インストールには管理者権限が求められます。
pl: Instalacja helpera wymaga uprawnień administratora i jest niezbędna dla działania BatFi.

# onboarding.label.launch_at_login_recommendation
source: Recommended. You can change it later in the app's settings.
ja: 推奨設定です。後でアプリの設定で変更できます。
pl: Zalecane. Możesz to zmienić później w ustawieniach aplikacji.

# onboarding.label.set_limit
source: Set Charging Limit.
ja: 充電制限を設定します。
pl: Ustaw poziom naładowania.

# onboarding.label.set_limit_description
source: Set a maximum charging percentage to prevent keeping charge level at 100%% and improve battery longevity.
ja: バッテリーの寿命を伸ばすために、充電が100%%のままになるのを防ぎましょう。そのために最大充電率を設定します。
pl: Ustaw maksymalny poziom naładowania by uniknąć ciągłego utrzymywania poziomu baterii na 100%% i przedłużyć jej żywotność.

# onboarding.label.set_limit_set_up_later
source: You can modify this setting later in the app's settings.
ja: この設定は、後でアプリの設定で変更できます。
pl: Możesz to później zmienić w ustawieniach aplikacji.

# onboarding.slider.label.set_limit
source: Turn off charging when battery will reach %@
ja: バッテリーが%@に達したら充電をオフにする
pl: Wyłącz ładowanie gdy bateria osiągnie %@

# settings.accessibility.title.charging
source: Charging pane
ja: 充電パネル
pl: Panel ustawień ładowania

# settings.accessibility.title.general
source: General pane
ja: 一般パネル
pl: Panel ustawień ogólnych

# settings.accessibility.title.notifications
source: Notifications pane
ja: 通知パネル
pl: Panel ustawień powiadomień

# settings.button.description.lid_must_be_opened
source: Works only with the lid opened.
ja: 蓋を開けた状態でのみ動作します。
pl: Działa tylko, gdy pokrywa z ekranem jest otwarta.

# settings.button.label.automatically_check_updates
source: Automatically check for updates
ja: 更新を自動的にチェックする
pl: Automatycznie sprawdzaj uaktualnienia

# settings.button.label.automatically_download_updates
source: Automatically download updates
ja: アップデートを自動的にダウンロードする
pl: Automatycznie pobieraj uaktualnienia

# settings.button.label.automatically_manage_charging
source: Automatically manage charging
ja: 充電を自動的に管理する
pl: Automatycznie zarządzaj ładowaniem

# settings.button.label.battery_percentage
source: Show battery percentage
ja: バッテリーの残量パーセントを表示
pl: Pokazuj procent baterii

# settings.button.label.charging_status_did_change
source: Charging status has changed
ja: 充電ステータスが変わった時に通知する
pl: Pokaż powiadomienia gdy tryb ładowania się zmienił

# settings.button.label.debug_menu
source: Show Debug menu
ja: デバッグメニューを表示
pl: Pokazuj menu do debugowania

# settings.button.label.disable_sleep
source: Delay automatic sleep when charging and the limit's not reached
ja: 充電時に自動スリープを遅らせ、過充電を避ける
pl: Opóźnij automatycznie usypianie systemu podczas ładowania, gdy limit nie został osiągnięty

# settings.button.label.discharge_batter_when_overcharged
source: Discharge battery when charged over limit
ja: 制限を超えて充電されたときにバッテリーを放電する
pl: Rozładuj baterię do osiągnięcia limitu ładowania

# settings.button.label.launch_at_login
source: Launch at login
ja: ログイン時に起動する
pl: Uruchom podczas logowania

# settings.button.label.monochrome_icon
source: Show monochrome icon
ja: モノクロのアイコンを表示
pl: Używaj monochromatycznej ikony

# settings.button.label.show_alerts_when_optimized_charging_is_engaged
source: Show alert when the optimized battery charging is engaged
ja: バッテリー充電の最適化が作動しているときにアラートを表示する
pl: Pokazuj alert gdy systemowe "zoptymalizowane ładowanie baterii" zostanie włączone

# settings.button.label.turn_off_charging_when_battery_is_hot
source: Automatically turn off charging when the battery gets hot
ja: バッテリーが熱くなったら、自動的に充電をオフにする
pl: Przerwij ładowanie gdy bateria będzie zbyt gorąca

# settings.button.tooltip.disable_sleep
source: The app will delay sleep so the computer charge up to the limit and then it'll inhibit charging and put the Mac to sleep
ja: このアプリはコンピュータが充電限界まで充電するのを遅らせ、その後、充電を停止し、Macをスリープ状態にします。
pl: Apka opóźni automatycznie usypianie systemu, pozwoli naładować baterię do wyznaczonego limitu, wstrzyma ładowanie i uśpi Maca

# settings.button.tooltip.discharge_batter_when_overcharged
source: When Macbook's lid is opened, the app can discharge battery until it will reach the limit
ja: Macbookの蓋を開けている時のみ、バッテリーを放電できます。クラムシェル時には無効化されます。
pl: Gdy klapa Macbooka jest otwarta, apka może rozładowywać baterie do momentu osiągnięcia limitu ładowania

# settings.button.tooltip.turn_off_charging_when_battery_is_hot
source: Turns off charging when the battery is 35°C or more.
ja: バッテリーが35°C以上の場合、充電をオフにします。
pl: Wyłącza ładowanie gdy temperatura baterii przekroczy 35°C

# settings.label.charging_recommendation_part1
source: 80%% is the recommended value for a day-to-day usage.
ja: 推奨される値は 80%% です。
pl: 80%% to rekomendowany limit ładowania podczas normalnego użytkowania.

# settings.label.charging_recommendation_part2
source: You can manually override this setting by using the "Charge to 100%%" command from the menu.
ja: メニューバーから「100%%まで充電する」を使用して、この設定を手動で書き換えることができます。
pl: Zawsze możesz naładować komputer używając polecenia "Naładuj do 100%%" z menu.

# settings.section.advanced
source: Advanced
ja: 開発者向け
pl: Zaawansowane

# settings.section.alerts
source: Alerts
ja: アラート
pl: Alerty

# settings.section.general
source: General
ja: 一般
pl: Ogólne

# settings.section.notifications
source: Notifications
ja: 通知
pl: Powiadomienia

# settings.section.status_icon
source: Status icon
ja: メニューバー
pl: Ikona statusu

# settings.section.updates
source: Updates
ja: アップデート
pl: Uaktualnienia

# settings.slider.label.turn_off_charging_at
source: Turn off charging when battery will reach %@
ja: バッテリーが%@に達したら充電をオフにする
pl: Wyłącz ładowanie gdy bateria osiągnie %@

# settings.tab.title.charging
source: Charging
ja: 充電
pl: Ładowanie

# settings.tab.title.general
source: General
ja: 一般
pl: Ogólne

# settings.tab.title.notifications
source: Notifications
ja: 通知
pl: Powiadomienia

# about.label.about_description
source: Made with ❤️ and 🔋 by
pl: Z ❤️ i 🔋 zrobione przez
